Revit 2026 API

# ReferenceIntersectorFindNearest Method

---

Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferenceWithContext FindNearest(
	XYZ origin,
	XYZ direction
)
```
```vb
Public Function FindNearest (
	origin As XYZ,
	direction As XYZ
) As ReferenceWithContext
```
```cpp
public:
ReferenceWithContext^ FindNearest(
	XYZ^ origin,
	XYZ^ direction
)
```
```fsharp
member FindNearest :
        origin : XYZ *
        direction : XYZ -> ReferenceWithContext
```

#### Parameters

origin XYZ
     The origin of the ray.
direction XYZ
     The direction of the ray.

#### Return Value

ReferenceWithContext The intersected reference nearest to the ray origin,  if none is found

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Note that FindNearest() is a convenience method, and other references that may be nearly the same distance from the origin can be obtained from Find(XYZ, XYZ).

#### Reference

ReferenceIntersector Class

Autodesk.Revit.DB Namespace